Tekla Open API Reference for Tekla Structures 2025
DetailMark Constructor (View, Point, Point, Point, DetailMark.DetailMarkAttributes)
 Creates a new detail mark instance with the given positions and attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DetailMark(
	View view,
	Point centerPoint,
	Point boundaryPoint,
	Point labelPoint,
	DetailMark.DetailMarkAttributes detailMarkAttributes
)
Public Sub New (
	view As View,
	centerPoint As Point,
	boundaryPoint As Point,
	labelPoint As Point,
	detailMarkAttributes As DetailMark.DetailMarkAttributes
)
Parameters
view
Type: Tekla.Structures.Drawing.View
The view to be used.
centerPoint
Type: Tekla.Structures.Geometry3d.Point
The center point to be used.
boundaryPoint
Type: Tekla.Structures.Geometry3d.Point
The boundary point to be used.
labelPoint
Type: Tekla.Structures.Geometry3d.Point
The label point to be used.
detailMarkAttributes
Type: Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes
The detail mark attributes to be used.
See Also
Reference
DetailMark Class
DetailMark Overload
Tekla.Structures.Drawing Namespace